//знайти числа, на які без залишку ділиться намбер для отримання чисел 3 і 5, і знайти суму цих чисел
// сам вперше пройшов 6 рівень!!!
function solution(number){
  let sum = 0;
  for (let i = 0; i <= number; i++) {
    if (i % 3 === 0 || i % 5 === 0) {
      sum += i;
    }
  }
  return sum;
}
console.log(solution(21));

// -------------------------------------------------------------------------------------

// !!!!! доробити, було трохи важко!!!!!
//в массиве найти число, которое появляется нечетное количество раз
function findOdd(A) {
  //happy coding!
  return 0;
}

// -------------------------------------------------------------------------------------